//0 , 1  , 2    ,3          ,4,         ,5    ，6
//幅，高さ,最高速,加速       ,ハンドリング,耐久 ，車名
let car_data =[
  [66,154,160,2,5,10,"スポーツカー"],
  [64,160,165,5,3,12,"スポーツカー2"],
  [60,156,140,5,4,15,"乗用車"],
  [64,160,200,8,3,8,"高級車"],
  [64,160,180,5,3,12,"パトカー"],
  [96,352,140,10,3,30,"トラック"],
  [96,352,140,10,3,30,"デコトラ1"],
  [96,352,140,10,3,30,"デコトラ2"]
];

//[5][6];
//x,y,速度  ,スポーン状態,車番  ,damge    ,hit
//0,1,2     ,3          ,4    ,5          ,6
let car_position = [
  [0,0,25,false,2,0,false], //NPC左
  [0,0,28,false,2,0,false], //NPC中
  [0,0,30,false,2,0,false], //NPC右
  [0,0,0,false,0,0,false],  //ライバル
  [0,0,0,false,0,0,false],  //パトカー?
  [0,0,0,false,0,0,false]   //player
]
